Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
<?xml version="1.0" encoding="utf-8"?>
	<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
		<vendor>bouffalolab</vendor>
		<vendorID>bouffalolab</vendorID>
		<name>702</name>
		<series>WiFi BT</series>
		<description>high-performance, 32-bit RV32IMAFC core</description>
		<addressUnitBits>8</addressUnitBits>
		<width>32</width>
		<size>32</size>
		<resetValue>0x00000000</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<cpu>
			<name>702</name>
			<endian>little</endian>
		</cpu>
		<peripherals>
			<peripheral>
				<name>glb</name>
				<description>glb.</description>
				<baseAddress>0x40000000</baseAddress>
				<groupName>glb</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>clk_cfg0</name>
						<description>clk_cfg0.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>glb_id</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>chip_rdy</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>fclk_sw_state</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>reg_bclk_div</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>reg_hclk_div</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>hbn_root_clk_sel</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_pll_sel</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_bclk_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_hclk_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_fclk_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_pll_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clk_cfg1</name>
						<description>clk_cfg1.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>reg_cam_ref_clk_div</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_cam_ref_clk_src_sel</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>reg_cam_ref_clk_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>m154_zbEn</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ble_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>ble_clk_sel</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_i2s_0_ref_clk_oe</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_i2s0_clk_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_i2s_clk_sel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dll_48m_div_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>usb_clk_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>qdec_clk_sel</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>qdec_clk_div</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clk_cfg2</name>
						<description>clk_cfg2.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>dma_clk_en</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ir_clk_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ir_clk_div</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>sf_clk_sel2</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>sf_clk_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>sf_clk_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>sf_clk_div</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>hbn_uart_clk_sel</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>uart_clk_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>uart_clk_div</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clk_cfg3</name>
						<description>clk_cfg3.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>chip_clk_out_1_sel</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>chip_clk_out_0_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>i2c_clk_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>i2c_clk_div</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cfg_inv_eth_rx_clk</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cfg_inv_rf_test_clk_o</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>spi_clk_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cfg_inv_eth_tx_clk</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cfg_inv_eth_ref_clk_o</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cfg_sel_eth_ref_clk_o</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>spi_clk_div</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>swrst_cfg0</name>
						<description>swrst_cfg0.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>swrst_s30</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>swrst_s20</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>swrst_s01</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>swrst_s00</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>swrst_cfg1</name>
						<description>swrst_cfg1.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>swrst_s1ae</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>swrst_s1ad</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>swrst_s1ac</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>swrst_s1ab</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>swrst_s1aa</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>swrst_s1a9</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>swrst_s1a8</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>swrst_s1a7</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>swrst_s1a6</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>swrst_s1a5</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>swrst_s1a4</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>swrst_s1a3</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>swrst_s1a2</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>swrst_s1a1</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>swrst_s1a0</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>swrst_s1f</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>swrst_s1e</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>swrst_s1d</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>swrst_s1c</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>swrst_s1b</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>swrst_s1a</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>swrst_s19</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>swrst_s18</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>swrst_s17</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>swrst_s16</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>swrst_s15</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>swrst_s14</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>swrst_s13</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>swrst_s12</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>swrst_s11</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>swrst_s10</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>swrst_cfg2</name>
						<description>swrst_cfg2.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>pka_clk_sel</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>reg_ctrl_reset_dummy</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_ctrl_sys_reset</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_ctrl_cpu_reset</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_ctrl_pwron_rst</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>swrst_cfg3</name>
						<description>swrst_cfg3.</description>
						<addressOffset>0x1C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>cgen_cfg0</name>
						<description>cgen_cfg0.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>cgen_m</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cgen_cfg1</name>
						<description>cgen_cfg1.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>cgen_s1a</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cgen_s1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cgen_cfg2</name>
						<description>cgen_cfg2.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>cgen_s3</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cgen_s2</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cgen_cfg3</name>
						<description>cgen_cfg3.</description>
						<addressOffset>0x2C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>MBIST_CTL</name>
						<description>MBIST_CTL.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>reg_mbist_rst_n</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>em_ram_mbist_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ocram_mbist_mode</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tag_mbist_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>hsram_cache_mbist_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>hsram_mem_mbist_mode</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>irom_mbist_mode</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MBIST_STAT</name>
						<description>MBIST_STAT.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>em_ram_mbist_fail</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ocram_mbist_fail</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tag_mbist_fail</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>hsram_cache_mbist_fail</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>hsram_mem_mbist_fail</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>irom_mbist_fail</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>em_ram_mbist_done</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ocram_mbist_done</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tag_mbist_done</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>hsram_cache_mbist_done</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>hsram_mem_mbist_done</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>irom_mbist_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>bmx_cfg1</name>
						<description>bmx_cfg1.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>hbn_apb_cfg</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pds_apb_cfg</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>hsel_option</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>bmx_gating_dis</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>bmx_busy_option_dis</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>bmx_err_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>bmx_arb_mode</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>bmx_timeout_en</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>bmx_cfg2</name>
						<description>bmx_cfg2.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>bmx_dbg_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_w_thre_l1c</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_w_thre_bmx</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>bmx_err_tz</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>bmx_err_dec</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>bmx_err_addr_dis</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>bmx_err_addr</name>
						<description>bmx_err_addr.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>bmx_err_addr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>bmx_dbg_out</name>
						<description>bmx_dbg_out.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>bmx_dbg_out</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsv0</name>
						<description>rsv0.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsv1</name>
						<description>rsv1.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsv2</name>
						<description>rsv2.</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsv3</name>
						<description>rsv3.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sram_ret</name>
						<description>sram_ret.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>reg_sram_ret</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sram_slp</name>
						<description>sram_slp.</description>
						<addressOffset>0x74</addressOffset>
						<fields>
							<field>
								<name>reg_sram_slp</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sram_parm</name>
						<description>sram_parm.</description>
						<addressOffset>0x78</addressOffset>
						<fields>
							<field>
								<name>reg_sram_parm</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>seam_misc</name>
						<description>seam_misc.</description>
						<addressOffset>0x7C</addressOffset>
						<fields>
							<field>
								<name>em_sel</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>glb_parm</name>
						<description>glb_parm.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>pin_sel_emac_cam</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_ext_rst_smt</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>reg_kys_drv_val</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>uart_swap_set</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>p6_jtag_use_io_0_2_7</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>p5_dac_test_with_jtag</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>p4_adc_test_with_jtag</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>p3_cci_use_io_0_2_7</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>p2_dac_test_with_cci</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>p1_adc_test_with_cci</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_cci_use_jtag_pin</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_spi_0_swap</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_spi_0_master_mode</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cfg_flash_scenario</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cfg_sflash2_swap_cs_io2</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cfg_sflash2_swap_io0_io3</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>jtag_swap_set</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDM_CLK_CTRL</name>
						<description>PDM_CLK_CTRL.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>reg_pdm0_clk_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_pdm0_clk_div</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_USE_PSRAM__IO</name>
						<description>GPIO_USE_PSRAM__IO.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>cfg_gpio_use_psram_io</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>CPU_CLK_CFG</name>
						<description>CPU_CLK_CFG.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>debug_ndreset_gate</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cpu_rtc_sel</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cpu_rtc_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cpu_rtc_div</name>
								<lsb>0</lsb>
								<msb>16</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPADC_32M_SRC_CTRL</name>
						<description>GPADC_32M_SRC_CTRL.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>gpadc_32m_div_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_32m_clk_sel</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpadc_32m_clk_div</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
