Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
					<register>
						<name>GPIO_CFGCTL11</name>
						<description>GPIO_CFGCTL11.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_23_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_23_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_23_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_23_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_23_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_23_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_22_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_22_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_22_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_22_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_22_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_22_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL12</name>
						<description>GPIO_CFGCTL12.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_25_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_25_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_25_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_25_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_25_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_25_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_24_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_24_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_24_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_24_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_24_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_24_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL13</name>
						<description>GPIO_CFGCTL13.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_27_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_27_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_27_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_27_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_27_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_27_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_26_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_26_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_26_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_26_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_26_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_26_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL14</name>
						<description>GPIO_CFGCTL14.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_29_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_29_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_29_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_29_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_29_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_29_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_28_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_28_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_28_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_28_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_28_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_28_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL15</name>
						<description>GPIO_CFGCTL15.</description>
						<addressOffset>0x13C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_31_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_31_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_31_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_31_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_31_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_31_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_30_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_30_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_30_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_30_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_30_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_30_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL16</name>
						<description>GPIO_CFGCTL16.</description>
						<addressOffset>0x140</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_33_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_33_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_33_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_33_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_33_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_32_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_32_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_32_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_32_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_32_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL17</name>
						<description>GPIO_CFGCTL17.</description>
						<addressOffset>0x144</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_35_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_35_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_35_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_35_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_35_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_34_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_34_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_34_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_34_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_34_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL18</name>
						<description>GPIO_CFGCTL18.</description>
						<addressOffset>0x148</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_37_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_37_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_37_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_37_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_37_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_36_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_36_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_36_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_36_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_36_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL30</name>
						<description>GPIO_CFGCTL30.</description>
						<addressOffset>0x180</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_31_i</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_30_i</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>reg_gpio_29_i</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>reg_gpio_28_i</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_27_i</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_26_i</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>reg_gpio_25_i</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>reg_gpio_24_i</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>reg_gpio_23_i</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>reg_gpio_22_i</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_i</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_i</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_i</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_i</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_i</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_i</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_i</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_i</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_i</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_i</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_i</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_i</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_i</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_i</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_i</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_i</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_i</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_i</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_i</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_i</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_i</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL31</name>
						<description>GPIO_CFGCTL31.</description>
						<addressOffset>0x184</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_CFGCTL32</name>
						<description>GPIO_CFGCTL32.</description>
						<addressOffset>0x188</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_31_o</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_30_o</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>reg_gpio_29_o</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>reg_gpio_28_o</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_27_o</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_26_o</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>reg_gpio_25_o</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>reg_gpio_24_o</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>reg_gpio_23_o</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>reg_gpio_22_o</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_o</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_o</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_o</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_o</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_o</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_o</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_o</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_o</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_o</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_o</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_o</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_o</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_o</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_o</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_o</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_o</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_o</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_o</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_o</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_o</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_o</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_o</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL33</name>
						<description>GPIO_CFGCTL33.</description>
						<addressOffset>0x18C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_CFGCTL34</name>
						<description>GPIO_CFGCTL34.</description>
						<addressOffset>0x190</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_31_oe</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_30_oe</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>reg_gpio_29_oe</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>reg_gpio_28_oe</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_27_oe</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_26_oe</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>reg_gpio_25_oe</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>reg_gpio_24_oe</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>reg_gpio_23_oe</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>reg_gpio_22_oe</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_oe</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_oe</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_oe</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_oe</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_oe</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_oe</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_oe</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_oe</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_oe</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_oe</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_oe</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_oe</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_oe</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_oe</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_oe</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_oe</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_oe</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_oe</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_oe</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_oe</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_oe</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_oe</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL35</name>
						<description>GPIO_CFGCTL35.</description>
						<addressOffset>0x194</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_INT_MASK1</name>
						<description>GPIO_INT_MASK1.</description>
						<addressOffset>0x1A0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mask1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_STAT1</name>
						<description>GPIO_INT_STAT1.</description>
						<addressOffset>0x1A8</addressOffset>
						<fields>
							<field>
								<name>gpio_int_stat1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_CLR1</name>
						<description>GPIO_INT_CLR1.</description>
						<addressOffset>0x1B0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_clr1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
