Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
					<register>
						<name>GPIO_INT_MODE_SET1</name>
						<description>GPIO_INT_MODE_SET1.</description>
						<addressOffset>0x1C0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set1</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET2</name>
						<description>GPIO_INT_MODE_SET2.</description>
						<addressOffset>0x1C4</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set2</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET3</name>
						<description>GPIO_INT_MODE_SET3.</description>
						<addressOffset>0x1C8</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set3</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET4</name>
						<description>GPIO_INT_MODE_SET4.</description>
						<addressOffset>0x1CC</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set4</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_MASK1</name>
						<description>GPIO_INT2_MASK1.</description>
						<addressOffset>0x1D0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_mask1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_STAT1</name>
						<description>GPIO_INT2_STAT1.</description>
						<addressOffset>0x1D4</addressOffset>
						<fields>
							<field>
								<name>gpio_int2_stat1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_CLR1</name>
						<description>GPIO_INT2_CLR1.</description>
						<addressOffset>0x1D8</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_clr1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_MODE_SET1</name>
						<description>GPIO_INT2_MODE_SET1.</description>
						<addressOffset>0x1DC</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_mode_set1</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_MODE_SET2</name>
						<description>GPIO_INT2_MODE_SET2.</description>
						<addressOffset>0x1E0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_mode_set2</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_MODE_SET3</name>
						<description>GPIO_INT2_MODE_SET3.</description>
						<addressOffset>0x1E4</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_mode_set3</name>
								<lsb>0</lsb>
								<msb>29</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT2_MODE_SET4</name>
						<description>GPIO_INT2_MODE_SET4.</description>
						<addressOffset>0x1E8</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int2_mode_set4</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dll</name>
						<description>dll.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>ppu_dll</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pu_dll</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>dll_reset</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dll_refclk_sel</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>dll_cp_hiz</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>dll_cp_op_en</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>dll_delay_sel</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>dll_post_div</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>dll_vctrl_force_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>dll_prechg_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>dll_prechg_reg</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>dll_prechg_sel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dll_vctrl_sel</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>dll_clk_57p6M_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>dll_clk_96M_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>dll_clk_144M_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>dll_clk_288M_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>dll_clk_mmdiv_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ten_dll</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>dtest_en_dll_outclk</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>dtest_en_dll_refclk</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>led_driver</name>
						<description>led_driver.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>pu_leddrv</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>leddrv_out_en</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>ir_rx_gpio_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>leddrv_ibias</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>led_din_polarity_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>led_din_sel</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>led_din_reg</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_xcvr</name>
						<description>usb_xcvr.</description>
						<addressOffset>0x228</addressOffset>
						<fields>
							<field>
								<name>usb_rcv</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>usb_vip</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>usb_vim</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>usb_bd</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>pu_usb</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>usb_sus</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>usb_spd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>usb_enum</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>usb_data_convert</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>usb_oeb</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>usb_oeb_reg</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>usb_oeb_sel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>usb_rout_pmos</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>usb_rout_nmos</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_usb_ldo</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>usb_ldo_vfb</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_xcvr_config</name>
						<description>usb_xcvr_config.</description>
						<addressOffset>0x22C</addressOffset>
						<fields>
							<field>
								<name>usb_slewrate_p_rise</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>usb_slewrate_p_fall</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>usb_slewrate_m_rise</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>usb_slewrate_m_fall</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>usb_res_pullup_tune</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_usb_use_ctrl</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>usb_str_drv</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_usb_use_xcvr</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>usb_bd_vth</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>usb_v_hys_p</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>usb_v_hys_m</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_ctrl</name>
						<description>gpdac_ctrl.</description>
						<addressOffset>0x308</addressOffset>
						<fields>
							<field>
								<name>gpdac_reserved</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpdac_test_sel</name>
								<lsb>9</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gpdac_ref_sel</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpdac_test_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpdacb_rstn_ana</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdaca_rstn_ana</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_actrl</name>
						<description>gpdac_actrl.</description>
						<addressOffset>0x30C</addressOffset>
						<fields>
							<field>
								<name>gpdac_a_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_a_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_ioa_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_a_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_bctrl</name>
						<description>gpdac_bctrl.</description>
						<addressOffset>0x310</addressOffset>
						<fields>
							<field>
								<name>gpdac_b_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_b_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_iob_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_b_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_data</name>
						<description>gpdac_data.</description>
						<addressOffset>0x314</addressOffset>
						<fields>
							<field>
								<name>gpdac_a_data</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gpdac_b_data</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>chip_revision</name>
						<description>chip_revision.</description>
						<addressOffset>0xE00</addressOffset>
						<fields>
							<field>
								<name>chip_rev</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_0</name>
						<description>tzc_glb_ctrl_0.</description>
						<addressOffset>0xF00</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_clk_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_mbist_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_dbg_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_bmx_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_l2c_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_sram_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_misc_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_ungated_ap_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_sys_reset_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_cpu_reset_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_pwron_rst_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s30_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s01_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s00_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_1</name>
						<description>tzc_glb_ctrl_1.</description>
						<addressOffset>0xF04</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_swrst_s1f_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1e_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1d_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1c_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1b_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1a_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s19_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s18_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s17_lock</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s16_lock</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s15_lock</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s14_lock</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s13_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s12_lock</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s11_lock</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s10_lock</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2f_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2e_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2d_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2c_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2b_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2a_lock</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s29_lock</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s28_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s27_lock</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s26_lock</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s25_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s24_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s23_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s22_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s21_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s20_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_2</name>
						<description>tzc_glb_ctrl_2.</description>
						<addressOffset>0xF08</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_gpio_31_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_30_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_29_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_28_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_27_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_26_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_25_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_24_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_23_lock</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_22_lock</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_21_lock</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_20_lock</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_19_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_18_lock</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_17_lock</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_16_lock</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_15_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_14_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_13_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_12_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_11_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_10_lock</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_9_lock</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_8_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_7_lock</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_6_lock</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_5_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_4_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_3_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_2_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_1_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_0_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_3</name>
						<description>tzc_glb_ctrl_3.</description>
						<addressOffset>0xF0C</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_gpio_37_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_36_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_35_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_34_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_33_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_32_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
