Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>cci</name>
				<description>cci.</description>
				<baseAddress>0x40008000</baseAddress>
				<groupName>cci</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>cci_cfg</name>
						<description>cci_cfg.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>reg_mcci_clk_inv</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_scci_clk_inv</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cfg_cci1_pre_read</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_div_m_cci_sclk</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_m_cci_sclk_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cci_mas_hw_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cci_mas_sel_cci2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cci_slv_sel_cci2</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cci_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cci_addr</name>
						<description>cci_addr.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>apb_cci_addr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cci_wdata</name>
						<description>cci_wdata.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>apb_cci_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cci_rdata</name>
						<description>cci_rdata.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>apb_cci_rdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cci_ctl</name>
						<description>cci_ctl.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>ahb_state</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cci_read_flag</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cci_write_flag</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>l1c</name>
				<description>l1c.</description>
				<baseAddress>0x40009000</baseAddress>
				<groupName>l1c</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>l1c_config</name>
						<description>l1c_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>reserved_31_30</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>l1c_flush_done</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>l1c_flush_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>wrap_dis</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>early_resp_dis</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>l1c_bmx_busy_option_dis</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>l1c_bmx_timeout_en</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>l1c_bmx_arb_mode</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>l1c_bmx_err_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>l1c_bypass</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>irom_2t_access</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>l1c_way_dis</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>l1c_wa_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>l1c_wb_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>l1c_wt_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>l1c_invalid_done</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>l1c_invalid_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>l1c_cnt_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>l1c_cacheable</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hit_cnt_lsb</name>
						<description>hit_cnt_lsb.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>hit_cnt_lsb</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hit_cnt_msb</name>
						<description>hit_cnt_msb.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>hit_cnt_msb</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>miss_cnt</name>
						<description>miss_cnt.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>miss_cnt</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>l1c_misc</name>
						<description>l1c_misc.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>l1c_fsm</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>l1c_bmx_err_addr_en</name>
						<description>l1c_bmx_err_addr_en.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>l1c_hsel_option</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>l1c_bmx_err_tz</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>l1c_bmx_err_dec</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>l1c_bmx_err_addr_dis</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>l1c_bmx_err_addr</name>
						<description>l1c_bmx_err_addr.</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>l1c_bmx_err_addr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irom1_misr_dataout_0</name>
						<description>irom1_misr_dataout_0.</description>
						<addressOffset>0x208</addressOffset>
						<fields>
							<field>
								<name>irom1_misr_dataout_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irom1_misr_dataout_1</name>
						<description>irom1_misr_dataout_1.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>irom1_misr_dataout_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cpu_clk_gate</name>
						<description>cpu_clk_gate.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>force_e21_clock_on_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>force_e21_clock_on_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>force_e21_clock_on_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
