Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>uart</name>
				<description>uart.</description>
				<baseAddress>0x4000A000</baseAddress>
				<groupName>uart</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>utx_config</name>
						<description>utx_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cr_utx_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_utx_bit_cnt_b</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_utx_bit_cnt_p</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_utx_bit_cnt_d</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_utx_ir_inv</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_utx_ir_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_utx_prt_sel</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_utx_prt_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_utx_lin_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_utx_frm_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_utx_cts_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_utx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>urx_config</name>
						<description>urx_config.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>cr_urx_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_urx_deg_cnt</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_urx_deg_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_urx_bit_cnt_d</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_urx_ir_inv</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_urx_ir_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_urx_prt_sel</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_urx_prt_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_urx_lin_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_urx_abr_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_urx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_bit_prd</name>
						<description>uart_bit_prd.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>cr_urx_bit_prd</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_utx_bit_prd</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>data_config</name>
						<description>data_config.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>cr_uart_bit_inv</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>utx_ir_position</name>
						<description>utx_ir_position.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>cr_utx_ir_pos_p</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_utx_ir_pos_s</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>urx_ir_position</name>
						<description>urx_ir_position.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>cr_urx_ir_pos_s</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>urx_rto_timer</name>
						<description>urx_rto_timer.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>cr_urx_rto_value</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_sw_mode</name>
						<description>uart_sw_mode.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>cr_urx_rts_sw_val</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_urx_rts_sw_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_utx_txd_sw_val</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_utx_txd_sw_mode</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_int_sts</name>
						<description>UART interrupt status</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>urx_lse_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>urx_fer_int</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>utx_fer_int</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>urx_pce_int</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>urx_rto_int</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>urx_fifo_int</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>utx_fifo_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>urx_end_int</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>utx_end_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_int_mask</name>
						<description>UART interrupt mask</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>cr_urx_lse_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_urx_fer_mask</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_utx_fer_mask</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_urx_pce_mask</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_urx_rto_mask</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_urx_fifo_mask</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_utx_fifo_mask</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_urx_end_mask</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_utx_end_mask</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_int_clear</name>
						<description>UART interrupt clear</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>cr_urx_lse_clr</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rsvd_7</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>rsvd_6</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_urx_pce_clr</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_urx_rto_clr</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rsvd_3</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rsvd_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_urx_end_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_utx_end_clr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_int_en</name>
						<description>UART interrupt enable</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>cr_urx_lse_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_urx_fer_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_utx_fer_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_urx_pce_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_urx_rto_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_urx_fifo_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_utx_fifo_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_urx_end_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_utx_end_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_status</name>
						<description>uart_status.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>sts_urx_bus_busy</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sts_utx_bus_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sts_urx_abr_prd</name>
						<description>sts_urx_abr_prd.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>sts_urx_abr_prd_0x55</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sts_urx_abr_prd_start</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_fifo_config_0</name>
						<description>uart_fifo_config_0.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>uart_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>uart_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_fifo_config_1</name>
						<description>uart_fifo_config_1.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>rx_fifo_th</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_fifo_th</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rx_fifo_cnt</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_fifo_wdata</name>
						<description>uart_fifo_wdata.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>uart_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>uart_fifo_rdata</name>
						<description>uart_fifo_rdata.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>uart_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
