Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>i2s</name>
				<description>i2s.</description>
				<baseAddress>0x4000AA00</baseAddress>
				<groupName>i2s</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>i2s_config</name>
						<description>i2s_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cr_ofs_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_ofs_cnt</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_mono_rx_ch</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_endian</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_i2s_mode</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_data_size</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_frame_size</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_fs_3ch_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_fs_4ch_mode</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_fs_1t_mode</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_mute_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_mono_mode</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_i2s_rxd_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_i2s_txd_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_i2s_s_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_i2s_m_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_int_sts</name>
						<description>i2s_int_sts.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>cr_i2s_fer_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>cr_i2s_rxf_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_i2s_txf_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_i2s_fer_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_i2s_rxf_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_i2s_txf_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>i2s_fer_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>i2s_rxf_int</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>i2s_txf_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_bclk_config</name>
						<description>i2s_bclk_config.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>cr_bclk_div_h</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_bclk_div_l</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_fifo_config_0</name>
						<description>i2s_fifo_config_0.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>cr_fifo_24b_lj</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_fifo_lr_exchg</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_fifo_lr_merge</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>i2s_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>i2s_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_fifo_config_1</name>
						<description>i2s_fifo_config_1.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>rx_fifo_th</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tx_fifo_th</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rx_fifo_cnt</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_fifo_wdata</name>
						<description>i2s_fifo_wdata.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>i2s_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_fifo_rdata</name>
						<description>i2s_fifo_rdata.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>i2s_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2s_io_config</name>
						<description>i2s_io_config.</description>
						<addressOffset>0xFC</addressOffset>
						<fields>
							<field>
								<name>cr_deg_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_deg_cnt</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_i2s_bclk_inv</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_i2s_fs_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_i2s_rxd_inv</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_i2s_txd_inv</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
