Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
					<register>
						<name>mjpeg_bit_cnt_f</name>
						<description>mjpeg_bit_cnt_f.</description>
						<addressOffset>0xFC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_f</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode0</name>
						<description>mjpeg_q_mode0.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_0</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode1</name>
						<description>mjpeg_q_mode1.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_1</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode2</name>
						<description>mjpeg_q_mode2.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_2</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode3</name>
						<description>mjpeg_q_mode3.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_3</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode4</name>
						<description>mjpeg_q_mode4.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_4</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode5</name>
						<description>mjpeg_q_mode5.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_5</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode6</name>
						<description>mjpeg_q_mode6.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_6</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode7</name>
						<description>mjpeg_q_mode7.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_7</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_8</name>
						<description>mjpeg_q_mode_8.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_8</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_9</name>
						<description>mjpeg_q_mode_9.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_9</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_a</name>
						<description>mjpeg_q_mode_a.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_a</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_b</name>
						<description>mjpeg_q_mode_b.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_b</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_c</name>
						<description>mjpeg_q_mode_c.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_c</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_d</name>
						<description>mjpeg_q_mode_d.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_d</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_e</name>
						<description>mjpeg_q_mode_e.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_e</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_q_mode_f</name>
						<description>mjpeg_q_mode_f.</description>
						<addressOffset>0x13C</addressOffset>
						<fields>
							<field>
								<name>frame_q_mode_f</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_debug</name>
						<description>mjpeg_debug.</description>
						<addressOffset>0x1F0</addressOffset>
						<fields>
							<field>
								<name>reg_mjpeg_dbg_sel</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_mjpeg_dbg_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_dummy_reg</name>
						<description>mjpeg_dummy_reg.</description>
						<addressOffset>0x1FC</addressOffset>
						<fields>
							<field>
								<name>mjpeg_dummy_reg</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>sf_ctrl</name>
				<description>sf_ctrl.</description>
				<baseAddress>0x4000B000</baseAddress>
				<groupName>sf_ctrl</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>sf_ctrl_0</name>
						<description>sf_ctrl_0.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>sf_id</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_aes_iv_endian</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>sf_aes_key_endian</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>sf_aes_ctr_plus_en</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>sf_aes_dout_endian</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>sf_aes_dly_mode</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>sf_if_int_set</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>sf_if_int_clr</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_if_int</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>sf_if_read_dly_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>sf_if_read_dly_n</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>sf_clk_sahb_sram_sel</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>sf_clk_out_inv_sel</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>sf_clk_out_gate_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sf_clk_sf_rx_inv_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_ctrl_1</name>
						<description>sf_ctrl_1.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>sf_ahb2sram_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_ahb2sif_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_if_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf_if_fn_sel</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>sf_ahb2sif_stop</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_ahb2sif_stopped</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>sf_if_reg_wp</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>sf_if_reg_hold</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>sf_if_0_ack_lat</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>sf_if_sr_int_set</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>sf_if_sr_int_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_if_sr_int</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>sf_if_sr_pat</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>sf_if_sr_pat_mask</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_sahb_0</name>
						<description>sf_if_sahb_0.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>sf_if_0_qpi_mode_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_if_0_spi_mode</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_if_0_cmd_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_if_0_adr_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>sf_if_0_dmy_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>sf_if_0_dat_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>sf_if_0_dat_rw  </name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>sf_if_0_cmd_byte</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>sf_if_0_adr_byte</name>
								<lsb>17</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>sf_if_0_dmy_byte</name>
								<lsb>12</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>sf_if_0_dat_byte</name>
								<lsb>2</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>sf_if_0_trig</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sf_if_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_sahb_1</name>
						<description>sf_if_sahb_1.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>sf_if_0_cmd_buf_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_sahb_2</name>
						<description>sf_if_sahb_2.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>sf_if_0_cmd_buf_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_iahb_0</name>
						<description>sf_if_iahb_0.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>sf_if_1_qpi_mode_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_if_1_spi_mode</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_if_1_cmd_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_if_1_adr_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>sf_if_1_dmy_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>sf_if_1_dat_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>sf_if_1_dat_rw  </name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>sf_if_1_cmd_byte</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>sf_if_1_adr_byte</name>
								<lsb>17</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>sf_if_1_dmy_byte</name>
								<lsb>12</lsb>
								<msb>16</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_iahb_1</name>
						<description>sf_if_iahb_1.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>sf_if_1_cmd_buf_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_iahb_2</name>
						<description>sf_if_iahb_2.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>sf_if_1_cmd_buf_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_status_0</name>
						<description>sf_if_status_0.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>sf_if_status_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_status_1</name>
						<description>sf_if_status_1.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>sf_if_status_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes</name>
						<description>sf_aes.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>sf_aes_status</name>
								<lsb>5</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_aes_pref_busy</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>sf_aes_pref_trig</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sf_aes_mode</name>
								<lsb>1</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>sf_aes_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_ahb2sif_status</name>
						<description>sf_ahb2sif_status.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>sf_ahb2sif_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_io_dly_0</name>
						<description>sf_if_io_dly_0.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>sf_dqs_do_dly_sel</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_dqs_di_dly_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf_dqs_oe_dly_sel</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_clk_out_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf_cs2_dly_sel</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sf_cs_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_io_dly_1</name>
						<description>sf_if_io_dly_1.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>sf_io_0_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_io_0_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf_io_0_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_io_dly_2</name>
						<description>sf_if_io_dly_2.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>sf_io_1_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_io_1_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf_io_1_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_io_dly_3</name>
						<description>sf_if_io_dly_3.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>sf_io_2_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_io_2_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf_io_2_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_if_io_dly_4</name>
						<description>sf_if_io_dly_4.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>sf_io_3_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf_io_3_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf_io_3_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_reserved</name>
						<description>sf_reserved.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>sf_reserved</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf2_if_io_dly_0</name>
						<description>sf2_if_io_dly_0.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>sf2_dqs_do_dly_sel</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf2_dqs_di_dly_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf2_dqs_oe_dly_sel</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf2_clk_out_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf2_cs2_dly_sel</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sf2_cs_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf2_if_io_dly_1</name>
						<description>sf2_if_io_dly_1.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>sf2_io_0_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf2_io_0_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf2_io_0_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf2_if_io_dly_2</name>
						<description>sf2_if_io_dly_2.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>sf2_io_1_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf2_io_1_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf2_io_1_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf2_if_io_dly_3</name>
						<description>sf2_if_io_dly_3.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>sf2_io_2_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf2_io_2_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf2_io_2_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf2_if_io_dly_4</name>
						<description>sf2_if_io_dly_4.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>sf2_io_3_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf2_io_3_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf2_io_3_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf3_if_io_dly_0</name>
						<description>sf3_if_io_dly_0.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>sf3_dqs_do_dly_sel</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf3_dqs_di_dly_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf3_dqs_oe_dly_sel</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf3_clk_out_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf3_cs2_dly_sel</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sf3_cs_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf3_if_io_dly_1</name>
						<description>sf3_if_io_dly_1.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>sf3_io_0_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf3_io_0_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf3_io_0_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf3_if_io_dly_2</name>
						<description>sf3_if_io_dly_2.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>sf3_io_1_do_dly_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>sf3_io_1_di_dly_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sf3_io_1_oe_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
