Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/soc702_reg.svd
					<register>
						<name>DMA_C5Control</name>
						<description>DMA_C5Control.</description>
						<addressOffset>0x60C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>fix_cnt</name>
								<lsb>23</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>dst_add_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>dst_min_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C5Config</name>
						<description>DMA_C5Config.</description>
						<addressOffset>0x610</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C6SrcAddr</name>
						<description>DMA_C6SrcAddr.</description>
						<addressOffset>0x700</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C6DstAddr</name>
						<description>DMA_C6DstAddr.</description>
						<addressOffset>0x704</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C6LLI</name>
						<description>DMA_C6LLI.</description>
						<addressOffset>0x708</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>2</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C6Control</name>
						<description>DMA_C6Control.</description>
						<addressOffset>0x70C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>fix_cnt</name>
								<lsb>23</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>dst_add_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>dst_min_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C6Config</name>
						<description>DMA_C6Config.</description>
						<addressOffset>0x710</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C7SrcAddr</name>
						<description>DMA_C7SrcAddr.</description>
						<addressOffset>0x800</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C7DstAddr</name>
						<description>DMA_C7DstAddr.</description>
						<addressOffset>0x804</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C7LLI</name>
						<description>DMA_C7LLI.</description>
						<addressOffset>0x808</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>2</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C7Control</name>
						<description>DMA_C7Control.</description>
						<addressOffset>0x80C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>fix_cnt</name>
								<lsb>23</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>dst_add_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>dst_min_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C7Config</name>
						<description>DMA_C7Config.</description>
						<addressOffset>0x810</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
